
using System.Globalization;
// Задачи семинара
// Итерация № 1
// Напишите программу которая на вход принимает число и выдает его квадрат (число умноженное на себя)

//Console.Write("Введите число");
//int number = int.Parse(Console.ReadLine();
 //Находим квадрат числа
//int sqr = number * number;
//Console.WriteLine($"Квадрат числа {number} равен {sqr}");


//Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
//a = 5; b = 25 -> да
//a = 2 b = 10 -> нет
//a = 9; b = -3 -> нет
//a = -3 b = 9 -> да

//Console.Write("Введите первое число");
//int numberA = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите второе число");
//int numberB = Convert.ToInt32(Console.ReadLine());
//if(numberA * numberA == numberB) Console.Write("Да");
//else Console.Write("Нет");


//Напишите программу, которая будет выдавать название дня недели по заданному номеру.
//3 -> Среда
//5 -> Пятница


//string[] Days = {"Понедельник", "Вторник", "Среда","Четверг","Пятница","Суббота","Воскресенье"};
//Console.WriteLine("Введите номер дня недели: ");
//int NumberOfDay = Convert.ToInt32(Console.ReadLine());
//Console.WriteLine(Days[NumberOfDay - 1]);

// Итерация № 2

// Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.
//4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
//2 -> " -2, -1, 0, 1, 2"

//Console.WriteLine("Введите положительное целое число: ");
//int number = int.Parse(Console.ReadLine());
//int count = number * - 1;
//while (count <= number)
//{
    //Console.Write($"{count}, ");
    //count++;
//}


//Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.
//456 -> 6
//782 -> 2
//918 -> 8

//последные задание не сделал так как было сложно (